ud02-almacenamiento-ingesta/01-teoria/Presentaciones/002/002-AlmacenamientoDistribuidoBeamer.org
#+TITLE: Sistemas de Almacenamiento Distribuido
#+AUTHOR: José Manuel Sánchez Álvarez
#+DATE: \today{}
#+LATEX_CLASS: beamer
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usetheme{metropolis}

* Introducción
El almacenamiento distribuido es clave para gestionar datos en Big Data.
- Divide datos entre múltiples nodos.
- Beneficios:
  - Escalabilidad.
  - Tolerancia a fallos.
  - Rendimiento eficiente.
  - Durabilidad.

---

* ¿Qué es el almacenamiento distribuido?
** Definición
- Divide los datos en fragmentos y los almacena en múltiples máquinas que simulan un único sistema.
- Ventajas:
  1. **Escalabilidad horizontal:** Agrega nodos para manejar el crecimiento de datos.
  2. **Tolerancia a fallos:** Datos accesibles desde nodos redundantes.
  3. **Eficiencia:** Reduce cuellos de botella.
  4. **Durabilidad:** Resiliencia ante fallos físicos.

---

* Sistemas Principales
** HDFS (Hadoop Distributed File System)
- Parte del ecosistema Apache Hadoop.
- Diseñado para grandes volúmenes de datos.

*** Características Clave
- Alto rendimiento para operaciones secuenciales.
- Escalabilidad horizontal.
- Replicación de bloques (por defecto 3 veces).
- Integración con herramientas como Apache Hive y Spark.

*** Arquitectura
1. **NameNode:** Administra metadatos.
2. **DataNodes:** Almacenan bloques de datos.

*** Casos de Uso
- Procesamiento analítico masivo.
- Gestión de datos históricos.

---

** Amazon S3
- Servicio de almacenamiento de objetos en la nube de AWS.

*** Características Clave
- Almacenamiento basado en objetos con metadatos únicos.
- Escalabilidad automática.
- Durabilidad de **11 nueves**.
- Integración con AWS Lambda, Athena, y más.

*** Clases de Almacenamiento
1. **S3 Standard:** Acceso frecuente.
2. **S3 Intelligent-Tiering:** Ajuste automático según el acceso.
3. **S3 Glacier:** Archivos de largo plazo.

*** Casos de Uso
- Almacenamiento multimedia.
- Copias de seguridad.
- Análisis de Big Data con Amazon EMR.

---

** Google Cloud Storage
- Servicio de almacenamiento de objetos de Google Cloud.

*** Características Clave
- Almacenamiento multirregional para redundancia.
- Consistencia fuerte.
- Integración con BigQuery.

*** Clases de Almacenamiento
1. **Standard Storage:** Datos de acceso frecuente.
2. **Nearline Storage:** Acceso menos de una vez al mes.
3. **Coldline Storage:** Acceso menos de una vez al año.
4. **Archive Storage:** Archivado de datos.

*** Casos de Uso
- Datos IoT.
- Logs analíticos.
- Archivos multimedia distribuidos globalmente.

---

** Azure Blob Storage
- Sistema de almacenamiento de objetos de Microsoft Azure.

*** Características Clave
- Diseñado para datos no estructurados como imágenes, vídeos y logs.
- Escalabilidad automática.

*** Niveles de Almacenamiento
1. **Hot Access Tier:** Acceso frecuente.
2. **Cool Access Tier:** Acceso poco frecuente.
3. **Archive Tier:** Archivado a largo plazo.

*** Casos de Uso
- Copias de seguridad empresariales.
- Datos analíticos en tiempo real.

---

* Comparación de Sistemas
\[
\begin{array}{|l|l|l|l|l|l|}
\hline
\textbf{Sistema} & \textbf{Tipo} & \textbf{Escalabilidad} & \textbf{Tolerancia a Fallos} & \textbf{Integración} & \textbf{Costo} \\
\hline
HDFS & Archivos & Alta & Alta (replicación) & Ecosistema Hadoop & Infraestructura propia \\
\hline
Amazon S3 & Objetos & Muy alta & Muy alta & AWS (Lambda, Athena, etc.) & Moderado \\
\hline
Google Cloud Storage & Objetos & Muy alta & Muy alta & GCP (BigQuery, Dataflow) & Moderado \\
\hline
Azure Blob Storage & Objetos & Muy alta & Muy alta & Azure (Synapse, Data Lake) & Moderado \\
\hline
\end{array}
\]

---

* Conclusión
Los sistemas de almacenamiento distribuido son esenciales para Big Data.
- **On-premises:** HDFS.
- **Nube:** Amazon S3, Google Cloud Storage, Azure Blob Storage.
- La elección depende de:
  - Costos.
  - Integración.
  - Requisitos de redundancia y durabilidad.
